## Plan Result (prod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to import, 11 to add, 4 to change, 10 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sendgrid-jira-api-key-secret
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * sendgrid_api_key.sendgrid-jira-api-key
* Replace
  * sendgrid_domain_authentication.sendgrid-domain-authenticate
  * terraform_data.vm[&#34;atlassian-prod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-prod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-prod-jira-03&#34;]
* Import
  * sendgrid_api_key.sendgrid-jira-api-key
  * sendgrid_domain_authentication.sendgrid-domain-authenticate




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway"
        name                              = "atlassian-prod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
        name                            = "atlasssian-prod-kv"
        tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.sendgrid-jira-api-key-secret will be created
  + resource "azurerm_key_vault_secret" "sendgrid-jira-api-key-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "jira-sendgrid-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-prod-flex-server"
        name                              = "atlassian-prod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # sendgrid_api_key.sendgrid-jira-api-key will be updated in-place
  # (imported from "mKQ52wP8SVmz7_YY8CsPHw")
  ~ resource "sendgrid_api_key" "sendgrid-jira-api-key" {
        id     = "mKQ52wP8SVmz7_YY8CsPHw"
        name   = "jira-email-prod"
      ~ scopes = [
          - "2fa_exempt",
            "2fa_required",
          - "mail.batch.create",
          - "mail.batch.delete",
          - "mail.batch.read",
          - "mail.batch.update",
            "mail.send",
            "sender_verification_eligible",
          - "user.scheduled_sends.create",
          - "user.scheduled_sends.delete",
          - "user.scheduled_sends.read",
          - "user.scheduled_sends.update",
            "whitelabel.create",
            "whitelabel.delete",
            "whitelabel.read",
            "whitelabel.update",
        ]
    }

  # sendgrid_domain_authentication.sendgrid-domain-authenticate must be replaced
  # (imported from "25482485")
  # Warning: this will destroy the imported resource
-/+ resource "sendgrid_domain_authentication" "sendgrid-domain-authenticate" {
      + automatic_security   = true # forces replacement
        custom_dkim_selector = null
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "s1.domainkey.u51930430.wl181.sendgrid.net"
              - host  = "s1._domainkey.cjscp.justice.gov.uk"
              - type  = "cname"
              - valid = true
            },
          - {
              - data  = "s2.domainkey.u51930430.wl181.sendgrid.net"
              - host  = "s2._domainkey.cjscp.justice.gov.uk"
              - type  = "cname"
              - valid = true
            },
          - {
              - data  = "u51930430.wl181.sendgrid.net"
              - host  = "em1187.cjscp.justice.gov.uk"
              - type  = "cname"
              - valid = true
            },
        ] -> (known after apply)
        domain               = "cjscp.justice.gov.uk"
      ~ id                   = "25482485" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ is_default           = false -> true
      ~ subdomain            = "em1187" -> (known after apply)
      ~ username             = "azure_acct_30ef49a32e6e3b659a7b198162c4663a761ef12e" -> (known after apply)
      ~ valid                = true -> (known after apply)
    }

  # terraform_data.vm["atlassian-prod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "6195922e-ad64-eea9-a845-6c1dff02c7ed" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "4a20c176-f4fc-614f-6d91-d84c25cac2ea" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "ab105d25-d7eb-ab74-b99b-072b7119c3eb" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "e08ed2ff-b60a-5723-06b9-de5d12ef28fd" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "0572730c-ac23-c1a3-a1a4-647ce36b2dd1" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "397efd93-336e-92f3-dcf0-e38376b8bd72" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "d0b2d9e6-0f7f-4811-d3e4-d1d4df891993" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "6ec9684a-6431-93f0-fc5c-23b0410f050c" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

  # terraform_data.vm["atlassian-prod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "b962b199-6873-a77f-ab8b-ff4571cc2469" -> (known after apply)
      ~ triggers_replace = [
          ~ "276731917f6be590c6bcc7ac26c1caa4" -> "344b9c5d7537c05258a590688d2f0e72",
            "15afea25b6d128671e9ba868905c6c9e",
          ~ "a9a6191b0542bc69b6410ee3efc5ae60" -> "567152921568c081ae4c666ba6355f9c",
            "4d04a56ef3bff64a2a1fec36659c6c33",
            # (2 unchanged elements hidden)
        ]
    }

Plan: 2 to import, 11 to add, 4 to change, 10 to destroy.

Changes to Outputs:
  + sendgrid_dns_records = {
      + record1 = {
          + data = (known after apply)
          + host = (known after apply)
        }
      + record2 = {
          + data = (known after apply)
          + host = (known after apply)
        }
      + record3 = {
          + data = (known after apply)
          + host = (known after apply)
        }
    }
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":96,"Program":"tfcmt","SHA1":"","Target":"prod_general - TerraformPlanApply","Vars":{}} -->